# Pandas

In [1]:
import numpy as np
import pandas as pd

In [2]:
#creating series 
countries=['USA','Nigeria','France','Ghana','India','Australia']
my_data=[100,200,300,400,500,600]

In [3]:
pd.Series(my_data,countries)

USA          100
Nigeria      200
France       300
Ghana        400
India        500
Australia    600
dtype: int64

In [4]:
np_arr=np.array(my_data)

# Creating series from numpy array

In [5]:
pd.Series(np_arr)

0    100
1    200
2    300
3    400
4    500
5    600
dtype: int32

# from python dictionary

In [6]:
my_dict={'a':60,'b':50,'c':80,'d':78}

In [7]:
pd.Series(my_dict)

a    60
b    50
c    80
d    78
dtype: int64

### Info from series

In [8]:
series1=pd.Series([1,2,3,4],['London','Hongkong','Lagos','Mumbai'])
series1['Hongkong']

2

### Arithmatic operations

In [9]:
series2=pd.Series([1,3,6,4],['London','Accra','Lagos','Delhi'])

In [10]:
series1-series2

Accra       NaN
Delhi       NaN
Hongkong    NaN
Lagos      -3.0
London      0.0
Mumbai      NaN
dtype: float64

In [11]:
series1+series2

Accra       NaN
Delhi       NaN
Hongkong    NaN
Lagos       9.0
London      2.0
Mumbai      NaN
dtype: float64

In [13]:
series1*series2

Accra        NaN
Delhi        NaN
Hongkong     NaN
Lagos       18.0
London       1.0
Mumbai       NaN
dtype: float64

# DataFrames

In [14]:
df=pd.DataFrame(np.random.rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.752170  0.939268  0.338708  0.985530
B  0.789573  0.894132  0.043879  0.865958
C  0.739349  0.565593  0.793947  0.306624
D  0.861104  0.112226  0.174079  0.472661
E  0.932369  0.391272  0.411952  0.276204

### From dictionary series

In [15]:
df={'Name':pd.Series(['John','Aaron','Todd'],index=['a','b','c']),
    'Age':pd.Series(['39','34','32','33'],index=['a','b','c','d']),
     'Nationality':pd.Series(['US','China','US'],['a','b','c'])
   }
pd.DataFrame(df)

    Name Age Nationality
a   John  39          US
b  Aaron  34       China
c   Todd  32          US
d    NaN  33         NaN

### Dictionaries of list

In [16]:
data={"name":['George','Ann','Tino','Charles','Phill'],
      "age":[50,45,60,52,42],
      "year":[2014,2015,2020,2030,2016]
     } 
my_df=pd.DataFrame(data,index = ['Lagos','duabi','Mumbai','Accra','Yuma'])
my_df

           name  age  year
Lagos    George   50  2014
duabi       Ann   45  2015
Mumbai     Tino   60  2020
Accra   Charles   52  2030
Yuma      Phill   42  2016

In [17]:
#extracting one data item drom series
my_df['name']

Lagos      George
duabi         Ann
Mumbai       Tino
Accra     Charles
Yuma        Phill
Name: name, dtype: object

In [18]:
#type of data used
type(my_df['name'])

pandas.core.series.Series

In [19]:
my_df[['name','year']]

           name  year
Lagos    George  2014
duabi       Ann  2015
Mumbai     Tino  2020
Accra   Charles  2030
Yuma      Phill  2016

### Adding columns to dataframe

In [20]:
df={'Name':pd.Series(['John','Aaron','Todd'],index=['a','b','c']),
    'Age':pd.Series(['39','34','32','33'],index=['a','b','c','d']),
    'Nationality':pd.Series(['US','China','US'],['a','b','c'])
   }
pd.DataFrame(df)

    Name Age Nationality
a   John  39          US
b  Aaron  34       China
c   Todd  32          US
d    NaN  33         NaN

In [21]:
df['Year']=pd.Series(['2016','2025','2030','2051'],['a','b','c','d'])
pd.DataFrame(df)

    Name Age Nationality  Year
a   John  39          US  2016
b  Aaron  34       China  2025
c   Todd  32          US  2030
d    NaN  33         NaN  2051

In [23]:
df['Birth_year']=df['Year']+df['Age']
df=pd.DataFrame(df)
df

    Name Age Nationality  Year Birth_year
a   John  39          US  2016     201639
b  Aaron  34       China  2025     202534
c   Todd  32          US  2030     203032
d    NaN  33         NaN  2051     205133

### Deleting rows and columns

In [24]:
df.drop('Birth_year',axis=1)

    Name Age Nationality  Year
a   John  39          US  2016
b  Aaron  34       China  2025
c   Todd  32          US  2030
d    NaN  33         NaN  2051

In [25]:
#to permanently delete the row or column use inplace
df.drop('d',axis=0) #df.drop('d',axis=0 , inplace=True)

    Name Age Nationality  Year Birth_year
a   John  39          US  2016     201639
b  Aaron  34       China  2025     202534
c   Todd  32          US  2030     203032

###  selecting rows in a dataframe

In [26]:
df.loc['a']

Name             John
Age                39
Nationality        US
Year             2016
Birth_year     201639
Name: a, dtype: object

In [27]:
df.iloc[1]

Name            Aaron
Age                34
Nationality     China
Year             2025
Birth_year     202534
Name: b, dtype: object

In [28]:
df.iloc[[0,1]]

    Name Age Nationality  Year Birth_year
a   John  39          US  2016     201639
b  Aaron  34       China  2025     202534

### to select the subset from a row and column

In [29]:
df.loc['b','Name']

'Aaron'

In [30]:
df.loc[['b','c'],['Name','Year']]

    Name  Year
b  Aaron  2025
c   Todd  2030

In [31]:
df= pd.DataFrame(np.random.rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df[df['W']>0]

          W         X         Y         Z
A  0.502270  0.283823  0.785316  0.293494
B  0.090458  0.651861  0.379871  0.328783
C  0.198660  0.459441  0.849387  0.977245
D  0.632699  0.211927  0.375793  0.130101
E  0.826904  0.636543  0.419936  0.370067

In [32]:
df[df['W']>0]['X']

A    0.283823
B    0.651861
C    0.459441
D    0.211927
E    0.636543
Name: X, dtype: float64

In [33]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.283823  0.785316
B  0.651861  0.379871
C  0.459441  0.849387
D  0.211927  0.375793
E  0.636543  0.419936

In [34]:
df

          W         X         Y         Z
A  0.502270  0.283823  0.785316  0.293494
B  0.090458  0.651861  0.379871  0.328783
C  0.198660  0.459441  0.849387  0.977245
D  0.632699  0.211927  0.375793  0.130101
E  0.826904  0.636543  0.419936  0.370067

In [35]:
df[(df['W']>0) |( df['X']>1)]

          W         X         Y         Z
A  0.502270  0.283823  0.785316  0.293494
B  0.090458  0.651861  0.379871  0.328783
C  0.198660  0.459441  0.849387  0.977245
D  0.632699  0.211927  0.375793  0.130101
E  0.826904  0.636543  0.419936  0.370067

### resetting  the index in dataframe

In [36]:
#temperory reset for permanent use inplace
df.reset_index() #reset_index(inplace=True)

  index         W         X         Y         Z
0     A  0.502270  0.283823  0.785316  0.293494
1     B  0.090458  0.651861  0.379871  0.328783
2     C  0.198660  0.459441  0.849387  0.977245
3     D  0.632699  0.211927  0.375793  0.130101
4     E  0.826904  0.636543  0.419936  0.370067

### setting index of data frame

In [37]:
df['ID']=['df1','df2','df3','df4','df5']
df

          W         X         Y         Z   ID
A  0.502270  0.283823  0.785316  0.293494  df1
B  0.090458  0.651861  0.379871  0.328783  df2
C  0.198660  0.459441  0.849387  0.977245  df3
D  0.632699  0.211927  0.375793  0.130101  df4
E  0.826904  0.636543  0.419936  0.370067  df5

In [38]:
df.set_index('ID')

            W         X         Y         Z
ID
df1  0.502270  0.283823  0.785316  0.293494
df2  0.090458  0.651861  0.379871  0.328783
df3  0.198660  0.459441  0.849387  0.977245
df4  0.632699  0.211927  0.375793  0.130101
df5  0.826904  0.636543  0.419936  0.370067

### multi level indexing

In [39]:
outside=['0 level','0 level','0 level','A level','A level','A level']
inside=[21,22,23,21,22,23]
my_index=list(zip(outside,inside))

### using multiindex from tuples

In [40]:
my_index=pd.MultiIndex.from_tuples(my_index)
my_index

MultiIndex([('0 level', 21),
            ('0 level', 22),
            ('0 level', 23),
            ('A level', 21),
            ('A level', 22),
            ('A level', 23)],
           )

In [41]:
df=pd.DataFrame(np.random.rand(6,2),index=my_index,columns=['A','B'])
df

                   A         B
0 level 21  0.019098  0.101569
        22  0.282596  0.065129
        23  0.136404  0.710040
A level 21  0.173833  0.609327
        22  0.953826  0.138256
        23  0.456394  0.739559

### Grabbing in O level

In [42]:
df.loc['0 level']

           A         B
21  0.019098  0.101569
22  0.282596  0.065129
23  0.136404  0.710040

In [43]:
df.loc['0 level'].loc[21]

A    0.019098
B    0.101569
Name: 21, dtype: float64

In [44]:
df.index.names=['Levels','Num']
df

                    A         B
Levels  Num
0 level 21   0.019098  0.101569
        22   0.282596  0.065129
        23   0.136404  0.710040
A level 21   0.173833  0.609327
        22   0.953826  0.138256
        23   0.456394  0.739559

## Cross section of rows and columns

In [45]:
df.xs(22,level='Num')

                A         B
Levels
0 level  0.282596  0.065129
A level  0.953826  0.138256

### Missing data

#### filling theh enpty data cell

In [46]:
dt={'A':[1,np.nan,3],'B':[2,np.nan,np.nan],'C':[4,5,6]}
dt=pd.DataFrame(dt)
dt

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

### delete any row or column having missing data

In [47]:
dt.dropna()

     A    B  C
0  1.0  2.0  4

In [48]:
dt.dropna(axis=1)

   C
0  4
1  5
2  6

### filling the value of the missing data

In [49]:
dt.fillna(('20')) #use inplace to permanently enter theh value

    A   B  C
0   1   2  4
1  20  20  5
2   3  20  6

In [50]:
dt

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

In [51]:
dt['A'].fillna(dt['A'].mean())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [53]:
dt

     A    B  C
0  1.0  2.0  4
1  NaN  NaN  5
2  3.0  NaN  6

# Group by

In [54]:
d={'Company':['GOOGLE','GOOGLE','ORACLE','ORACLE','TWITTER','TWITTER'],
   'Person':['San','Charlie','Amy','Vanessa','Carl','Sarah'],
   'Sales':[200,522,632,410,852,120]}

In [55]:
df=pd.DataFrame(d)
df

   Company   Person  Sales
0   GOOGLE      San    200
1   GOOGLE  Charlie    522
2   ORACLE      Amy    632
3   ORACLE  Vanessa    410
4  TWITTER     Carl    852
5  TWITTER    Sarah    120

In [56]:
df.groupby('Company').mean() #gives the mean of sales of each company

         Sales
Company
GOOGLE     361
ORACLE     521
TWITTER    486

### count

##### Using the count() method, we can get the number of times an item occurs in a DataFrame.

In [57]:
df.groupby('Company').count()

         Person  Sales
Company
GOOGLE        2      2
ORACLE        2      2
TWITTER       2      2

# Describe

##### gives all the details of the table

In [58]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Company
GOOGLE    2.0  361.0  227.688384  200.0  280.5  361.0  441.5  522.0
ORACLE    2.0  521.0  156.977705  410.0  465.5  521.0  576.5  632.0
TWITTER   2.0  486.0  517.602164  120.0  303.0  486.0  669.0  852.0

### transpose to switch the layout

In [59]:
df.groupby('Company').describe().transpose()

Company          GOOGLE      ORACLE     TWITTER
Sales count    2.000000    2.000000    2.000000
      mean   361.000000  521.000000  486.000000
      std    227.688384  156.977705  517.602164
      min    200.000000  410.000000  120.000000
      25%    280.500000  465.500000  303.000000
      50%    361.000000  521.000000  486.000000
      75%    441.500000  576.500000  669.000000
      max    522.000000  632.000000  852.000000

In [60]:
df.groupby('Company').describe().transpose()['GOOGLE']

Sales  count      2.000000
       mean     361.000000
       std      227.688384
       min      200.000000
       25%      280.500000
       50%      361.000000
       75%      441.500000
       max      522.000000
Name: GOOGLE, dtype: float64

# Concatenating, Merging, and Joining DataFrames

### concatenation

In [61]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7]) 
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [62]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [63]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [64]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [65]:
pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [66]:
pd.concat([df1,df2,df3],1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

### Merging

### inner means intersection and outer means union

In [67]:
left = pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right=pd.DataFrame({'Key': ['K0', 'K1', 'K2', 'K3'],
                        'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7']})
pd.merge(left,right,how='inner',on='Key')

  Key A_x B_x A_y B_y
0  K0  A0  B0  A4  B4
1  K1  A1  B1  A5  B5
2  K2  A2  B2  A6  B6
3  K3  A3  B3  A7  B7

In [68]:
left = pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                     'key2':['K1', 'K11', 'K22', 'K33'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
right=pd.DataFrame({'key1': ['K0', 'K1', 'K2', 'K3'],
                    'key2': ['K1', 'K11', 'K22', 'K33'],    
                        'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7']})
pd.merge(left,right,on=['key1','key2'])

  key1 key2 A_x B_x A_y B_y
0   K0   K1  A0  B0  A4  B4
1   K1  K11  A1  B1  A5  B5
2   K2  K22  A2  B2  A6  B6
3   K3  K33  A3  B3  A7  B7

### joining

In [69]:
data1={'A':['A0','A1','A2'],
       'B':['B0','B1','B2']}
left=pd.DataFrame(data1,index=['K0','K1','K2'])
data2={'C':['C0','C1','C2'],
       'D':['D0','D1','D2']}
right=pd.DataFrame(data2,index=['K0','K2','K3'])
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C1   D1

In [70]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3  NaN  NaN   C2   D2

# finding unique values in data frames

In [71]:
df=pd.DataFrame({'col1':[1,2,3,2],'col2':[444,555,666,777],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     2   777  xyz

In [72]:
df['col1'].unique()

array([1, 2, 3], dtype=int64)

In [73]:
#no. of unique digits in a column
df['col2'].nunique()

4

In [74]:
df['col1'].value_counts()

2    2
3    1
1    1
Name: col1, dtype: int64

### The .apply() method is used to call custom functions on a DataFrame.

In [75]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     2   777  xyz

In [76]:
def square(x):
    return x*x
df['col1'].apply(square)

0    1
1    4
2    9
3    4
Name: col1, dtype: int64

In [77]:
#attributes
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [78]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [79]:
#sorting
df.sort_values('col1')

   col1  col2 col3
0     1   444  abc
1     2   555  def
3     2   777  xyz
2     3   666  ghi

In [80]:
#to find the null (returns boolean)
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [87]:
#pivot table
data={
    'A':['Dog','Dog','Dog','Goat','Goat','Goat'],
    'B':['Brown','Brown','Black','Black','Brown','Brown'],
    'C':['x','y','x','y','x','y'],
    'D':[1,3,2,5,4,1]
}
df=pd.DataFrame(data)
df

      A      B  C  D
0   Dog  Brown  x  1
1   Dog  Brown  y  3
2   Dog  Black  x  2
3  Goat  Black  y  5
4  Goat  Brown  x  4
5  Goat  Brown  y  1

In [88]:
pd.pivot_table(df,values='D',index=['A','B'],columns=['C'])

C             x    y
A    B
Dog  Black  2.0  NaN
     Brown  1.0  3.0
Goat Black  NaN  5.0
     Brown  4.0  1.0

In [89]:
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C             x    y
A    B
Dog  Black  2.0  NaN
     Brown  1.0  3.0
Goat Black  NaN  5.0
     Brown  4.0  1.0